## dev plan
```
module.eks.aws_launch_configuration.workers[0] (deposed object 5d15ca78): Refreshing state... [id=andrei-eks-worker-group-120220318131138820500000015]
module.eks.aws_autoscaling_group.workers[0] (deposed object c547a308): Refreshing state... [id=andrei-eks-worker-group-120220318134039185000000001]
module.eks.aws_autoscaling_group.workers[0] (deposed object 4c4bbcea): Refreshing state... [id=andrei-eks-worker-group-120220318131150126500000016]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00f675e927e318400]
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::994647055425:policy/andrei-eks-deny-log-group20220318130253018900000003]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::994647055425:policy/andrei-eks-elb-sl-role-creation20220318130253013100000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=andrei-eks20220318130253017400000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f739aa38270edde7]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253738900000007]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253729300000005]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253718200000004]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253730100000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=andrei-eks20220318130253017400000002-20220318130253742000000008]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a169b14c8d14fd3f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05412ced6b2018325]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02336bd68343bb267]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ac0c439e4fbdb4dc]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-06a754dc7e546975f]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00a53d337fa341fc4]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07df29cf09e46847a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-07af7bec87dc68ebf]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01a4879f14d9f69e4]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06ffc133c3fe2f77f]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-0640ab11386009488]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0924af1a13f38c82c]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0313e8245f678a8ea]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0d54464eea313cb61]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c46fe44f7b79d13f]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08df75d58e8e5bd32]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-052183efebe0a187b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a169b14c8d14fd3f1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0011e14ef6aca8597]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-082f381f56f1cf8a4]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0536dd736b0b700f8]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05872f795eb47015d]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2472320124]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-2287975513]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-204945054]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2308962083]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3249731164]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-1113048186]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07df29cf09e46847a1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=andrei-eks]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=761770546894ce136652d2351aa4140ea750e426]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e-20220318131138735300000013]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=andrei-eks20220318131138608100000010]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e-20220318131138717900000012]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=andrei-eks2022031813113780340000000e-20220318131138649900000011]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=andrei-eks2022031813113860660000000f]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=andrei-eks-worker-group-220220318131138816800000014]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=andrei-eks-worker-group-120220318135645896200000001]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=andrei-eks-worker-group-120220318135647832900000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.aws_launch_configuration.workers[0] has been changed
  ~ resource "aws_launch_configuration" "workers" {
        id                               = "andrei-eks-worker-group-120220318135645896200000001"
        name                             = "andrei-eks-worker-group-120220318135645896200000001"
      + vpc_classic_link_security_groups = []
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }
  # module.eks.aws_autoscaling_group.workers[0] has been changed
  ~ resource "aws_autoscaling_group" "workers" {
      + arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:805a9c6f-c2ad-43e3-a9ab-645692a2926e:autoScalingGroupName/andrei-eks-worker-group-120220318135647832900000002"
      ~ availability_zones        = [
          + "eu-north-1a",
          + "eu-north-1b",
          + "eu-north-1c",
        ]
      + default_cooldown          = 300
      + enabled_metrics           = []
      + health_check_type         = "EC2"
        id                        = "andrei-eks-worker-group-120220318135647832900000002"
      + load_balancers            = []
      + name                      = "andrei-eks-worker-group-120220318135647832900000002"
      + service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
      ~ suspended_processes       = [
          - "AZRebalance",
        ]
      + target_group_arns         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }
  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_andrei-eks
            
            contexts:
            - context:
                cluster: eks_andrei-eks
                user: eks_andrei-eks
              name: eks_andrei-eks
            
            current-context: eks_andrei-eks
            
            users:
            - name: eks_andrei-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "andrei-eks"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_andrei-eks" -> null
      - id                   = "761770546894ce136652d2351aa4140ea750e426" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_autoscaling_group.workers[0] is tainted, so must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:805a9c6f-c2ad-43e3-a9ab-645692a2926e:autoScalingGroupName/andrei-eks-worker-group-120220318135647832900000002" -> (known after apply)
      ~ availability_zones        = [
          - "eu-north-1a",
          - "eu-north-1b",
          - "eu-north-1c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      ~ desired_capacity          = 2 -> 1
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "andrei-eks-worker-group-120220318135647832900000002" -> (known after apply)
      ~ launch_configuration      = "andrei-eks-worker-group-120220318135645896200000001" -> (known after apply)
      - load_balancers            = [] -> null
      ~ max_size                  = 3 -> 2
      ~ name                      = "andrei-eks-worker-group-120220318135647832900000002" -> (known after apply)
      ~ service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      ~ suspended_processes       = [
          + "AZRebalance",
        ]
      - target_group_arns         = [] -> null
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] (deposed object 4c4bbcea) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_autoscaling_group" "workers" {
      - arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:3f6ac6f3-1b45-4c2b-8009-7a1156e96a85:autoScalingGroupName/andrei-eks-worker-group-120220318131150126500000016" -> null
      - availability_zones        = [
          - "eu-north-1a",
          - "eu-north-1b",
          - "eu-north-1c",
        ] -> null
      - capacity_rebalance        = false -> null
      - default_cooldown          = 300 -> null
      - desired_capacity          = 2 -> null
      - enabled_metrics           = [] -> null
      - force_delete              = false -> null
      - force_delete_warm_pool    = false -> null
      - health_check_grace_period = 300 -> null
      - health_check_type         = "EC2" -> null
      - id                        = "andrei-eks-worker-group-120220318131150126500000016" -> null
      - launch_configuration      = "andrei-eks-worker-group-120220318131138820500000015" -> null
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      - max_size                  = 3 -> null
      - metrics_granularity       = "1Minute" -> null
      - min_size                  = 1 -> null
      - name                      = "andrei-eks-worker-group-120220318131150126500000016" -> null
      - name_prefix               = "andrei-eks-worker-group-1" -> null
      - protect_from_scale_in     = false -> null
      - service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      - vpc_zone_identifier       = [
          - "subnet-02336bd68343bb267",
          - "subnet-05412ced6b2018325",
          - "subnet-0ac0c439e4fbdb4dc",
        ] -> null
      - wait_for_capacity_timeout = "10m" -> null

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "andrei-eks-worker-group-1-eks_asg" -> null
        }
      - tag {
          - key                 = "k8s.io/cluster/andrei-eks" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      - tag {
          - key                 = "kubernetes.io/cluster/andrei-eks" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
    }

  # module.eks.aws_autoscaling_group.workers[0] (deposed object c547a308) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_autoscaling_group" "workers" {
      - arn                       = "arn:aws:autoscaling:eu-north-1:994647055425:autoScalingGroup:1e160ac7-1572-48f5-afdb-021265087651:autoScalingGroupName/andrei-eks-worker-group-120220318134039185000000001" -> null
      - availability_zones        = [
          - "eu-north-1a",
          - "eu-north-1b",
          - "eu-north-1c",
        ] -> null
      - capacity_rebalance        = false -> null
      - default_cooldown          = 300 -> null
      - desired_capacity          = 2 -> null
      - enabled_metrics           = [] -> null
      - force_delete              = false -> null
      - force_delete_warm_pool    = false -> null
      - health_check_grace_period = 300 -> null
      - health_check_type         = "EC2" -> null
      - id                        = "andrei-eks-worker-group-120220318134039185000000001" -> null
      - launch_configuration      = "andrei-eks-worker-group-120220318131138820500000015" -> null
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      - max_size                  = 3 -> null
      - metrics_granularity       = "1Minute" -> null
      - min_size                  = 1 -> null
      - name                      = "andrei-eks-worker-group-120220318134039185000000001" -> null
      - name_prefix               = "andrei-eks-worker-group-1" -> null
      - protect_from_scale_in     = false -> null
      - service_linked_role_arn   = "arn:aws:iam::994647055425:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes       = [] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      - vpc_zone_identifier       = [
          - "subnet-02336bd68343bb267",
          - "subnet-05412ced6b2018325",
          - "subnet-0ac0c439e4fbdb4dc",
        ] -> null
      - wait_for_capacity_timeout = "10m" -> null

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "andrei-eks-worker-group-1-eks_asg" -> null
        }
      - tag {
          - key                 = "k8s.io/cluster/andrei-eks" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      - tag {
          - key                 = "kubernetes.io/cluster/andrei-eks" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
    }

  # module.eks.aws_iam_instance_profile.workers[1] will be destroyed
  - resource "aws_iam_instance_profile" "workers" {
      - arn         = "arn:aws:iam::994647055425:instance-profile/andrei-eks20220318131138608100000010" -> null
      - create_date = "2022-03-18T13:11:38Z" -> null
      - id          = "andrei-eks20220318131138608100000010" -> null
      - name        = "andrei-eks20220318131138608100000010" -> null
      - name_prefix = "andrei-eks" -> null
      - path        = "/" -> null
      - role        = "andrei-eks2022031813113780340000000e" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPA6PFMVTRAZMVFDNKW6" -> null
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:c5e65a64-8cc5-4a93-bbc3-6322df704167:launchConfigurationName/andrei-eks-worker-group-120220318135645896200000001" -> (known after apply)
      ~ ebs_optimized                    = false -> true # forces replacement
      ~ id                               = "andrei-eks-worker-group-120220318135645896200000001" -> (known after apply)
      ~ instance_type                    = "t2.large" -> "m4.large" # forces replacement
      + key_name                         = (known after apply)
      ~ name                             = "andrei-eks-worker-group-120220318135645896200000001" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (7 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[0] (deposed object 5d15ca78) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_launch_configuration" "workers" {
      - arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:e76cf438-0eec-405b-a9e4-35b2e49f51fe:launchConfigurationName/andrei-eks-worker-group-120220318131138820500000015" -> null
      - associate_public_ip_address      = false -> null
      - ebs_optimized                    = false -> null
      - enable_monitoring                = true -> null
      - iam_instance_profile             = "andrei-eks2022031813113860660000000f" -> null
      - id                               = "andrei-eks-worker-group-120220318131138820500000015" -> null
      - image_id                         = "ami-0e7747683c4988ae6" -> null
      - instance_type                    = "t2.small" -> null
      - name                             = "andrei-eks-worker-group-120220318131138820500000015" -> null
      - name_prefix                      = "andrei-eks-worker-group-1" -> null
      - security_groups                  = [
          - "sg-06a754dc7e546975f",
          - "sg-0d54464eea313cb61",
        ] -> null
      - user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplVTFFVFhoUFJFVjZUVVJuTUU1R2IxaEVWRTE1VFVSTmVFNVVSWHBOUkdjd1RrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGxoSENtbzNNMjVtVkVaSFdVWmtaMWg1U21NM2EwSjNUVGhFTkZSR1lWY3dhWEYwWVc1Rk1XZFZNa05hVVZOd05EbExZalZXVWpCNFdVZHZSVTgxVDBWYVRtVUtSV0o0VTNoT01EUnhaWEl5VEhCeFUycDZTMWhMYm1OMFoyRnZOQzlxTmxVclUybE9ObFJXU25aVWNXZDNjR3MwUmxkRFZscFFhbEpRVnpKVmNXSTRhZ3BpZUhOTk5ESllNRkkzWlU5d0wxUmpTbTVPWWtWbmVtcEZiMkpSWXpZNU1FZ3ZOazFsWm1Vdk5FOUlNMnhyYkhOaWJtNVBiRzFoTWxrdlpUWmtSSGxRQ21FeEwwUjBXaXQ0VFROd00xa3hkbTFDVW5KcU1GRmxMMGhsWmtJd2NtOW1NbUpGZW1aNU5IaFhiME5DT0hOa1ZqUkNlRE5FT0ZWamJWRm9UalpFTDFrS2NqTmliVGxGVDI1Qk1HWmlhRkpVVTNVemExbElXRVl2WW0weWVtUkhLM0UyZDA5TVVHczJjRkZVYWxadFoxQTNibEY2WW05c1duZENaRGxMYjFKeWNRbzJXRUZyTldaQlVsVmhRVzFSYVVvMVkwdFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxka3hIVkVOck5YQmpSRkpIVjFBNFFVSktRVUVyZVVaSk1XRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNURlUzTVROdGVuUXdTM0kwU1hWaVUxcDFObTlJWmtaV1FrTnRUR2R6YUVSVVdWRnNSa2Q0U2tob2RVd3JSa2hQZGdwUU5UQjFPR2xWWWxkT2JqRk9jVlIxTDFGbmVHeGFkMjVMTmpCeVozTXlVR2RQUlhVMFQybFRNbVJzWWxKNVpVZEtNVzgwYTFaWFdGcG5iSG8yY2t4aENtRjBaU3REWnpCMlUwbFVhVTlGTlVaU1ZqZFBkbkpCWmsxc2NXbDNSbTlCYWtRMWEyaHBOSFZ4YVZGeWJXdEJSMDFHV0dGa1dtOU1PV2RqTkU5QmJYTUtZbnA0TlZScllYWXdUemRNZUN0NGQwUnZZMXB4TW1OaldXOXVSMWhyTmxjdk1VOURjSE5wVFhCV01YTkpXSGd2T0VWTFVHNUpZakJMUmsxak1VUlViQXBaVkhoRFlrZFNia3hPWkN0MVkxUjRRMFIwZDIxVVNXZE5kVWw2V20xdlZ6QkpiamRzVVZoSmJYZEZVMHhNZW1SVmIycGpRVkptU214d2IwbG5MMFpJQ2prMk1WQmhORFptTjFSTGJ5dGlibmxrZUVKTllXUjVRMWh4TVVOcFRYTmhiRGRWUXdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzE3RjIxNEQ3QTY2ODQyMzg3QjFDMDg3MDU0NTNEN0Muc2sxLmV1LW5vcnRoLTEuZWtzLmFtYXpvbmF3cy5jb20nICAtLWt1YmVsZXQtZXh0cmEtYXJncyAiIiAnYW5kcmVpLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> null
      - vpc_classic_link_security_groups = [] -> null

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - throughput            = 0 -> null
          - volume_size           = 100 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.eks.aws_launch_configuration.workers[1] will be destroyed
  - resource "aws_launch_configuration" "workers" {
      - arn                              = "arn:aws:autoscaling:eu-north-1:994647055425:launchConfiguration:a878ac94-96b5-4975-81e1-347aed002a32:launchConfigurationName/andrei-eks-worker-group-220220318131138816800000014" -> null
      - associate_public_ip_address      = false -> null
      - ebs_optimized                    = false -> null
      - enable_monitoring                = true -> null
      - iam_instance_profile             = "andrei-eks20220318131138608100000010" -> null
      - id                               = "andrei-eks-worker-group-220220318131138816800000014" -> null
      - image_id                         = "ami-0e7747683c4988ae6" -> null
      - instance_type                    = "t2.small" -> null
      - name                             = "andrei-eks-worker-group-220220318131138816800000014" -> null
      - name_prefix                      = "andrei-eks-worker-group-2" -> null
      - security_groups                  = [
          - "sg-0640ab11386009488",
          - "sg-0d54464eea313cb61",
        ] -> null
      - user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplVTFFVFhoUFJFVjZUVVJuTUU1R2IxaEVWRTE1VFVSTmVFNVVSWHBOUkdjd1RrWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGxoSENtbzNNMjVtVkVaSFdVWmtaMWg1U21NM2EwSjNUVGhFTkZSR1lWY3dhWEYwWVc1Rk1XZFZNa05hVVZOd05EbExZalZXVWpCNFdVZHZSVTgxVDBWYVRtVUtSV0o0VTNoT01EUnhaWEl5VEhCeFUycDZTMWhMYm1OMFoyRnZOQzlxTmxVclUybE9ObFJXU25aVWNXZDNjR3MwUmxkRFZscFFhbEpRVnpKVmNXSTRhZ3BpZUhOTk5ESllNRkkzWlU5d0wxUmpTbTVPWWtWbmVtcEZiMkpSWXpZNU1FZ3ZOazFsWm1Vdk5FOUlNMnhyYkhOaWJtNVBiRzFoTWxrdlpUWmtSSGxRQ21FeEwwUjBXaXQ0VFROd00xa3hkbTFDVW5KcU1GRmxMMGhsWmtJd2NtOW1NbUpGZW1aNU5IaFhiME5DT0hOa1ZqUkNlRE5FT0ZWamJWRm9UalpFTDFrS2NqTmliVGxGVDI1Qk1HWmlhRkpVVTNVemExbElXRVl2WW0weWVtUkhLM0UyZDA5TVVHczJjRkZVYWxadFoxQTNibEY2WW05c1duZENaRGxMYjFKeWNRbzJXRUZyTldaQlVsVmhRVzFSYVVvMVkwdFZRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkxka3hIVkVOck5YQmpSRkpIVjFBNFFVSktRVUVyZVVaSk1XRk5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNURlUzTVROdGVuUXdTM0kwU1hWaVUxcDFObTlJWmtaV1FrTnRUR2R6YUVSVVdWRnNSa2Q0U2tob2RVd3JSa2hQZGdwUU5UQjFPR2xWWWxkT2JqRk9jVlIxTDFGbmVHeGFkMjVMTmpCeVozTXlVR2RQUlhVMFQybFRNbVJzWWxKNVpVZEtNVzgwYTFaWFdGcG5iSG8yY2t4aENtRjBaU3REWnpCMlUwbFVhVTlGTlVaU1ZqZFBkbkpCWmsxc2NXbDNSbTlCYWtRMWEyaHBOSFZ4YVZGeWJXdEJSMDFHV0dGa1dtOU1PV2RqTkU5QmJYTUtZbnA0TlZScllYWXdUemRNZUN0NGQwUnZZMXB4TW1OaldXOXVSMWhyTmxjdk1VOURjSE5wVFhCV01YTkpXSGd2T0VWTFVHNUpZakJMUmsxak1VUlViQXBaVkhoRFlrZFNia3hPWkN0MVkxUjRRMFIwZDIxVVNXZE5kVWw2V20xdlZ6QkpiamRzVVZoSmJYZEZVMHhNZW1SVmIycGpRVkptU214d2IwbG5MMFpJQ2prMk1WQmhORFptTjFSTGJ5dGlibmxrZUVKTllXUjVRMWh4TVVOcFRYTmhiRGRWUXdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQzE3RjIxNEQ3QTY2ODQyMzg3QjFDMDg3MDU0NTNEN0Muc2sxLmV1LW5vcnRoLTEuZWtzLmFtYXpvbmF3cy5jb20nICAtLWt1YmVsZXQtZXh0cmEtYXJncyAiIiAnYW5kcmVpLWVrcycKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> null
      - vpc_classic_link_security_groups = [] -> null

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - throughput            = 0 -> null
          - volume_size           = 100 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://C17F214D7A66842387B1C08705453D7C.sk1.eu-north-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhPREV6TURnME5Gb1hEVE15TURNeE5URXpNRGcwTkZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTlhHCmo3M25mVEZHWUZkZ1h5SmM3a0J3TThENFRGYVcwaXF0YW5FMWdVMkNaUVNwNDlLYjVWUjB4WUdvRU81T0VaTmUKRWJ4U3hOMDRxZXIyTHBxU2p6S1hLbmN0Z2FvNC9qNlUrU2lONlRWSnZUcWd3cGs0RldDVlpQalJQVzJVcWI4agpieHNNNDJYMFI3ZU9wL1RjSm5OYkVnempFb2JRYzY5MEgvNk1lZmUvNE9IM2xrbHNibm5PbG1hMlkvZTZkRHlQCmExL0R0Wit4TTNwM1kxdm1CUnJqMFFlL0hlZkIwcm9mMmJFemZ5NHhXb0NCOHNkVjRCeDNEOFVjbVFoTjZEL1kKcjNibTlFT25BMGZiaFJUU3Uza1lIWEYvYm0yemRHK3E2d09MUGs2cFFUalZtZ1A3blF6Ym9sWndCZDlLb1JycQo2WEFrNWZBUlVhQW1RaUo1Y0tVQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLdkxHVENrNXBjRFJHV1A4QUJKQUEreUZJMWFNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCTFU3MTNtenQwS3I0SXViU1p1Nm9IZkZWQkNtTGdzaERUWVFsRkd4SkhodUwrRkhPdgpQNTB1OGlVYldObjFOcVR1L1FneGxad25LNjByZ3MyUGdPRXU0T2lTMmRsYlJ5ZUdKMW80a1ZXWFpnbHo2ckxhCmF0ZStDZzB2U0lUaU9FNUZSVjdPdnJBZk1scWl3Rm9BakQ1a2hpNHVxaVFybWtBR01GWGFkWm9MOWdjNE9BbXMKYnp4NVRrYXYwTzdMeCt4d0RvY1pxMmNjWW9uR1hrNlcvMU9DcHNpTXBWMXNJWHgvOEVLUG5JYjBLRk1jMURUbApZVHhDYkdSbkxOZCt1Y1R4Q0R0d21USWdNdUl6Wm1vVzBJbjdsUVhJbXdFU0xMemRVb2pjQVJmSmxwb0lnL0ZICjk2MVBhNDZmN1RLbytibnlkeEJNYWR5Q1hxMUNpTXNhbDdVQwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_andrei-eks
            
            contexts:
            - context:
                cluster: eks_andrei-eks
                user: eks_andrei-eks
              name: eks_andrei-eks
            
            current-context: eks_andrei-eks
            
            users:
            - name: eks_andrei-eks
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "andrei-eks"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_andrei-eks"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```